{
  "hi": "Hello! How can I assist you today?",
  "hello": "Hi there! Ask me anything about digital tools.",
  "hey": "Hey! How can I help?",
  "how are you": "I'm doing well. How can I help you today?",
  "who are you": "I'm your friendly chatbot for the Digital Literacy Campaign!",
  "what can you do": "I can help you understand digital tools like WhatsApp, Paytm, Google Maps, and more.",
  "thank you": "You're welcome! Feel free to ask me anything else.",
  "thanks": "Glad to help! What else can I assist you with?",
  "bye": "Goodbye! Have a great day.",
  "how do i send a photo on whatsapp": "Open the chat, tap the attachment icon (like a paperclip), choose the photo, and tap Send.",
  "how to create a whatsapp group": "In WhatsApp, go to Chats > New Chat > New Group, then add participants and a group name.",
  "how to delete a whatsapp message": "Tap and hold the message, then tap the trash icon to delete it for yourself or for everyone.",
  "what is google pay": "Google Pay is a digital wallet app that lets you make secure payments and transfers.",
  "how to use paytm": "Open Paytm, choose your service (like recharge or bill pay), enter details, and complete payment.",
  "how to add money to paytm wallet": "In Paytm, tap 'Add Money', enter the amount, and choose your payment method.",
  "how to share location on google maps": "Open Google Maps, tap your location, and choose 'Share' to send it to your contacts.",
  "how to search a place in google maps": "Open Google Maps, type the place name in the search bar, and view the results.",
  "what is upi": "UPI (Unified Payments Interface) is a real-time payment system that lets you transfer money instantly.",
  "how to pay with upi": "Use your bank app or Google Pay/Paytm to enter the recipient’s UPI ID and send money instantly.",
  "how to recharge a mobile phone online": "Use Paytm, Google Pay, or your bank’s app to enter your phone number, select an operator, and pay.",
  "how to reset my gmail password": "Go to Google Account settings > Security > Password, and follow the steps to reset it.",
  "what is digital literacy": "Digital literacy means knowing how to use digital tools like smartphones, computers, and apps safely and effectively.",
  "how to install an app on my phone": "Go to Google Play Store or App Store, search for the app, and tap 'Install'.",
  "how to take a screenshot": "On most phones, press the Power + Volume Down buttons at the same time to take a screenshot.",
  "how to use whatsapp": "Open WhatsApp, tap a chat to open it, type your message, and tap send. Use the attachment icon to send photos, videos, or documents.",
  "how to use whatsapp?": "Open WhatsApp, tap a chat to open it, type your message, and tap send. Use the attachment icon to send photos, videos, or documents.",
  "group whatsapp": "To create a group on WhatsApp, open WhatsApp > tap 'New Chat' > select 'New Group' > add participants and set group name."
}
